; domain
(define (domain satellite-typed)
(:requirements :equality :strips :typing)
(:types satellite
        direction
        instrument
        mode)
(:predicates
 (on_board ?i - instrument ?s - satellite)
 (supports ?i - instrument ?m - mode)
 (pointing ?s - satellite ?d - direction)
 (power_avail ?s - satellite)
 (power_on ?i - instrument)
 (calibrated ?i - instrument)
 (have_image ?d - direction ?m - mode)
 (calibration_target ?i - instrument ?d - direction))

(:action turn_to
 :parameters ( ?s - satellite ?d_new ?d_prev - direction)
 :precondition
 (and
      (pointing ?s ?d_prev)
      )
 :effect
 (and (pointing ?s ?d_new)
      (not (pointing ?s ?d_prev))))

(:action switch_on
 :parameters (?i - instrument ?s - satellite)
 :precondition
 (and (on_board ?i ?s)
      (power_avail ?s))
 :effect
 (and (power_on ?i)
      (not (calibrated ?i))
      (not (power_avail ?s))))

(:action switch_off
 :parameters (?i - instrument ?s - satellite)
 :precondition
	(and (on_board ?i ?s)
             (power_on ?i))
 :effect
	(and (power_avail ?s)
             (not (power_on ?i))))

(:action calibrate
 :parameters (?i - instrument ?s - satellite ?d - direction)
 :precondition
	(and (on_board ?i ?s)
             (calibration_target ?i ?d)
             (pointing ?s ?d)
             (power_on ?i))
 :effect
	 (calibrated ?i))

(:action take_image
 :parameters (?i - instrument ?s - satellite ?d - direction ?m - mode)
 :precondition
	(and (calibrated ?i)
             (on_board ?i ?s)
             (supports ?i ?m)
             (power_on ?i)
             (pointing ?s ?d))
 :effect
	 (have_image ?d ?m))

)

; problem
(DEFINE (PROBLEM SATELLITE-TYPED-4) (:DOMAIN SATELLITE-TYPED)
 (:OBJECTS PHENOMENON9 - DIRECTION PHENOMENON8 - DIRECTION STAR7 - DIRECTION
  STAR6 - DIRECTION PLANET5 - DIRECTION STAR4 - DIRECTION PLANET3 - DIRECTION
  STAR2 - DIRECTION STAR0 - DIRECTION GROUNDSTATION1 - DIRECTION THERMOGRAPH2 -
  MODE INFRARED1 - MODE INFRARED0 - MODE INSTRUMENT2 - INSTRUMENT INSTRUMENT1 -
  INSTRUMENT SATELLITE1 - SATELLITE INSTRUMENT0 - INSTRUMENT SATELLITE0 -
  SATELLITE)
 (:INIT (POINTING SATELLITE1 STAR0) (POWER_AVAIL SATELLITE1)
  (ON_BOARD INSTRUMENT2 SATELLITE1) (ON_BOARD INSTRUMENT1 SATELLITE1)
  (CALIBRATION_TARGET INSTRUMENT2 STAR2) (SUPPORTS INSTRUMENT2 INFRARED1)
  (SUPPORTS INSTRUMENT2 THERMOGRAPH2) (CALIBRATION_TARGET INSTRUMENT1 STAR2)
  (SUPPORTS INSTRUMENT1 INFRARED1) (SUPPORTS INSTRUMENT1 THERMOGRAPH2)
  (SUPPORTS INSTRUMENT1 INFRARED0) (POINTING SATELLITE0 STAR6)
  (POWER_AVAIL SATELLITE0) (ON_BOARD INSTRUMENT0 SATELLITE0)
  (CALIBRATION_TARGET INSTRUMENT0 STAR0) (SUPPORTS INSTRUMENT0 INFRARED0)
  (SUPPORTS INSTRUMENT0 THERMOGRAPH2))
 (:GOAL
  (AND (POINTING SATELLITE1 PLANET5) (HAVE_IMAGE PLANET3 INFRARED1)
       (HAVE_IMAGE STAR4 INFRARED1) (HAVE_IMAGE PLANET5 THERMOGRAPH2)
       (HAVE_IMAGE STAR6 INFRARED1) (HAVE_IMAGE STAR7 INFRARED0)
       (HAVE_IMAGE PHENOMENON8 THERMOGRAPH2)
       (HAVE_IMAGE PHENOMENON9 INFRARED0))))

; plan
1. (turn_to satellite1 star2 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 star2)
   goals met: 0 of 8
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 8
3. (calibrate instrument1 satellite1 star2)
   added: (calibrated instrument1)
   goals met: 0 of 8
4. (turn_to satellite1 star6 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 star6)
   goals met: 0 of 8
5. (take_image instrument1 satellite1 star6 infrared1)
   added: (have_image star6 infrared1)
   goals met: 1 of 8
6. (turn_to satellite1 star4 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star4)
   goals met: 1 of 8
7. (take_image instrument1 satellite1 star4 infrared1)
   added: (have_image star4 infrared1)
   goals met: 2 of 8
8. (turn_to satellite1 planet3 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 planet3)
   goals met: 2 of 8
9. (take_image instrument1 satellite1 planet3 infrared1)
   added: (have_image planet3 infrared1)
   goals met: 3 of 8
10. (turn_to satellite1 star7 planet3)
   deleted: (pointing satellite1 planet3)
   added: (pointing satellite1 star7)
   goals met: 3 of 8
11. (take_image instrument1 satellite1 star7 infrared0)
   added: (have_image star7 infrared0)
   goals met: 4 of 8
12. (turn_to satellite1 phenomenon9 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 phenomenon9)
   goals met: 4 of 8
13. (take_image instrument1 satellite1 phenomenon9 infrared0)
   added: (have_image phenomenon9 infrared0)
   goals met: 5 of 8
14. (turn_to satellite1 phenomenon8 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon8)
   goals met: 5 of 8
15. (take_image instrument1 satellite1 phenomenon8 thermograph2)
   added: (have_image phenomenon8 thermograph2)
   goals met: 6 of 8
16. (turn_to satellite1 planet5 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 planet5)
   goals met: 7 of 8
17. (take_image instrument1 satellite1 planet5 thermograph2)
   added: (have_image planet5 thermograph2)
   goals met: 8 of 8
